SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG26/Include/efr32mg26_cmu.h
/* Bit fields for CMU CLKEN2 */
#define _CMU_CLKEN2_RESETVALUE                     0x00000000UL                         /**< Default value for CMU_CLKEN2                */
#define _CMU_CLKEN2_MASK                           0x000007FFUL                         /**< Mask for CMU_CLKEN2                         */
#define CMU_CLKEN2_TIMER5                          (0x1UL << 0)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_TIMER5_SHIFT                   0                                    /**< Shift value for CMU_TIMER5                  */
#define _CMU_CLKEN2_TIMER5_MASK                    0x1UL                                /**< Bit mask for CMU_TIMER5                     */
#define _CMU_CLKEN2_TIMER5_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_TIMER5_DEFAULT                  (_CMU_CLKEN2_TIMER5_DEFAULT << 0)    /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_TIMER6                          (0x1UL << 1)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_TIMER6_SHIFT                   1                                    /**< Shift value for CMU_TIMER6                  */
#define _CMU_CLKEN2_TIMER6_MASK                    0x2UL                                /**< Bit mask for CMU_TIMER6                     */
#define _CMU_CLKEN2_TIMER6_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_TIMER6_DEFAULT                  (_CMU_CLKEN2_TIMER6_DEFAULT << 1)    /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_TIMER7                          (0x1UL << 2)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_TIMER7_SHIFT                   2                                    /**< Shift value for CMU_TIMER7                  */
#define _CMU_CLKEN2_TIMER7_MASK                    0x4UL                                /**< Bit mask for CMU_TIMER7                     */
#define _CMU_CLKEN2_TIMER7_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_TIMER7_DEFAULT                  (_CMU_CLKEN2_TIMER7_DEFAULT << 2)    /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_TIMER8                          (0x1UL << 3)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_TIMER8_SHIFT                   3                                    /**< Shift value for CMU_TIMER8                  */
#define _CMU_CLKEN2_TIMER8_MASK                    0x8UL                                /**< Bit mask for CMU_TIMER8                     */
#define _CMU_CLKEN2_TIMER8_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_TIMER8_DEFAULT                  (_CMU_CLKEN2_TIMER8_DEFAULT << 3)    /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_TIMER9                          (0x1UL << 4)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_TIMER9_SHIFT                   4                                    /**< Shift value for CMU_TIMER9                  */
#define _CMU_CLKEN2_TIMER9_MASK                    0x10UL                               /**< Bit mask for CMU_TIMER9                     */
#define _CMU_CLKEN2_TIMER9_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_TIMER9_DEFAULT                  (_CMU_CLKEN2_TIMER9_DEFAULT << 4)    /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_EUSART2                         (0x1UL << 5)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_EUSART2_SHIFT                  5                                    /**< Shift value for CMU_EUSART2                 */
#define _CMU_CLKEN2_EUSART2_MASK                   0x20UL                               /**< Bit mask for CMU_EUSART2                    */
#define _CMU_CLKEN2_EUSART2_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_EUSART2_DEFAULT                 (_CMU_CLKEN2_EUSART2_DEFAULT << 5)   /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_EUSART3                         (0x1UL << 6)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_EUSART3_SHIFT                  6                                    /**< Shift value for CMU_EUSART3                 */
#define _CMU_CLKEN2_EUSART3_MASK                   0x40UL                               /**< Bit mask for CMU_EUSART3                    */
#define _CMU_CLKEN2_EUSART3_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_EUSART3_DEFAULT                 (_CMU_CLKEN2_EUSART3_DEFAULT << 6)   /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_USART1                          (0x1UL << 7)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_USART1_SHIFT                   7                                    /**< Shift value for CMU_USART1                  */
#define _CMU_CLKEN2_USART1_MASK                    0x80UL                               /**< Bit mask for CMU_USART1                     */
#define _CMU_CLKEN2_USART1_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_USART1_DEFAULT                  (_CMU_CLKEN2_USART1_DEFAULT << 7)    /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_USART2                          (0x1UL << 8)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_USART2_SHIFT                   8                                    /**< Shift value for CMU_USART2                  */
#define _CMU_CLKEN2_USART2_MASK                    0x100UL                              /**< Bit mask for CMU_USART2                     */
#define _CMU_CLKEN2_USART2_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_USART2_DEFAULT                  (_CMU_CLKEN2_USART2_DEFAULT << 8)    /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_I2C2                            (0x1UL << 9)                         /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_I2C2_SHIFT                     9                                    /**< Shift value for CMU_I2C2                    */
#define _CMU_CLKEN2_I2C2_MASK                      0x200UL                              /**< Bit mask for CMU_I2C2                       */
#define _CMU_CLKEN2_I2C2_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_I2C2_DEFAULT                    (_CMU_CLKEN2_I2C2_DEFAULT << 9)      /**< Shifted mode DEFAULT for CMU_CLKEN2         */
#define CMU_CLKEN2_I2C3                            (0x1UL << 10)                        /**< Enable Bus Clock                            */
#define _CMU_CLKEN2_I2C3_SHIFT                     10                                   /**< Shift value for CMU_I2C3                    */
#define _CMU_CLKEN2_I2C3_MASK                      0x400UL                              /**< Bit mask for CMU_I2C3                       */
#define _CMU_CLKEN2_I2C3_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for CMU_CLKEN2                 */
#define CMU_CLKEN2_I2C3_DEFAULT                    (_CMU_CLKEN2_I2C3_DEFAULT << 10)     /**< Shifted mode DEFAULT for CMU_CLKEN2         */

